//Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
//452 -> 11
//82 -> 10
//9012 -> 12

int Promt (string message)
{
	Console.Write(message);
	int num = int.Parse(Console.ReadLine()!);
	return num;
}

int SearchNumber (int a)
{
int [] array = {};
int i;
while ();

}

int Number = Promt ("Введите число: ");




// 	if(a >= 10)  //находим первое число
// 	num1 = a/10;
	
// 	if(a>=100) // находим второе число
// 	num2 = (a/10)%10;
	
// 	if (a>1000) // находим третье число
// 	num3= (a/10);